# 8.	Вывести на экран числа от 0 до 50, кроме 35.

for i in range(51):
    if i != 35:
        print(i)
        
