# 5.	Создать список с числами от 1 до 50 используя генератор списков.

numbers = [i for i in range(1, 51)]
print(numbers)
