# 3.	Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.

variable = None
if variable:
    print("Переменная истинная")
else:
    print("Переменная ложная")
#   None - ложное значение


