# Пользователь вводит три числа. Если все числа больше 10, то вывести на экран yes, иначе no.

number1 = int(input('Введите 1 число:'))
number2 = int(input('Введите 2 число:'))
number3 = int(input('Введите 3 число:'))
if number1 > 10 and number2 > 10 and number3 > 10:
    print("yes")
else:
    print("no")




